Revit 2024 API
BuiltInFailures.InfillFailures.FamilyInstanceIsNotCuttingHost Property
 Instance is not cutting host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FamilyInstanceIsNotCuttingHost { get; }
Visual Basic
Public Shared ReadOnly Property FamilyInstanceIsNotCuttingHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FamilyInstanceIsNotCuttingHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace